# Дана строка. Преобразовать в ней все строчные буквы (как латинские, так и русские)
# в прописные.

text = input('Введите строку>> ')  # Вводим строку

upper_text = text.upper()  # Преобразовываем строку

print(upper_text)  # Вывод готовой строки