# Дана строка. Преобразовать в ней все строчные буквы (как латинские, так и русские)
# в прописные.

text = input('Введите строку>> ')

upper_text = text.upper()

print(upper_text)