# Дана строка. Преобразовать в ней все строчные буквы (как латинские, так и русские)
# в прописные.

text = input('Введите строку>> ')


print(text.upper())